export default {
  // 仅支持数字（不包括小数点）
  num: /^[0-9]+$/,
  // 正数、负数、和小数
  number: /^(-|\+)?\d+(\.\d+)?$/,
  // 支持整数和保留两位的小数
  moneyFixTwo: /^0*(\.0{1,2})?$|^\d{1,13}(\.\d{1,2})?$/,
  // 支持数字，小数点
  money: /(?!^0*(\.0{1,2})?$)^\d{1,13}(\.\d{1,2})?$/,
  // 支持正负整数
  pnNum: /^(0|[1-9][0-9]*|-[1-9][0-9]*)$/,
  // 手机号码
  mobile: /^(1(?:3\d|4[4-9]|5[0-35-9]|6[67]|7[013-8]|8\d|9\d)\d{8})?$/,
  // 座机
  phone: /^0\d{2,3}-?\d{7,8}$/,
  // 支持座机和手机号码
  mobilePhone: /^(((0\d{2,3}|8\d{2,3})-\d{7,8})|(1(?:3\d|4[4-9]|5[0-35-9]|6[67]|7[013-8]|8\d|9\d)\d{8}))$/,
  // 邮箱
  // email: /^([a-zA-Z0-9_.-]+@[a-zA-Z0-9-]+(\.[a-zA-Z0-9-]+)*\.[a-zA-Z0-9]{2,6})?$/,
  companyEmail: /@\w+([-.]\w+)*\.[a-zA-Z0-9]{2,6}?$/, // 企业邮箱暂不需要对@前做验证
  // 空格
  space: /^[^ ]+$/,
  // 银行账号
  bank: /^([1-9]{1})(\d{15}|\d{18})$/,
  // 身份证
  identityCard: /(^[1-9]\d{5}(18|19|20)\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$)|(^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}$)/,
  // 军官证
  officerCard: /^[\u4E00-\u9FA5](字第)([0-9a-zA-Z]{4,8})(号?)$/,
  // 护照：E03497615
  passPortCard: /^1[45][0-9]{7}$|([P|p|S|s]\d{7}$)|([S|s|G|g|E|e]\d{8}$)|([Gg|Tt|Ss|Ll|Qq|Dd|Aa|Ff]\d{8}$)|([H|h|M|m]\d{8,10})$/,
  // 营业执照：91330212MA2AG46J1L
  bussinessCard: /^[^_IOZSVa-z\W]{2}\d{6}[^_IOZSVa-z\W]{10}$/,
  // 港澳居民往来内地返乡证
  MTPFHKAMR: /^[HMhm]{1}([0-9]{10}|[0-9]{8})$/,
  // 台湾居民往来大陆通行证
  MTPFTR: /^([0-9]{10}|[0-9]{8})$/,
  // 英文和数字
  enAndNumber: /^[A-Za-z0-9]+$/,
  // 中文、日文、韩文
  Chiness: /[\u4E00-\u9FA5\uF900-\uFA2D]/,
  // 不允许中文
  noChiness: /^[^\u4E00-\u9FA5\uF900-\uFA2D]+$/,
  // 中文数字英文
  onlyChinessNumEng: /^[A-Za-z0-9\u4e00-\u9fa5]+$/,
  // 标点符号
  punctuation: /^[^ %&',;=?$\x22]+$/
}
